HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDsadc_regdef.h
/** \\brief  Carrier Generator Configuration Register */
typedef struct _Ifx_DSADC_CGCFG_Bits
{
    unsigned int CGMOD:2;                   /**< \brief [1:0] Carrier Generator Operating Mode (rw) */
    unsigned int BREV:1;                    /**< \brief [2:2] Bit-Reverse PWM Generation (rw) */
    unsigned int SIGPOL:1;                  /**< \brief [3:3] Signal Polarity (rw) */
    unsigned int DIVCG:4;                   /**< \brief [7:4] Divider Factor for the PWM Pattern Signal Generator (rw) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int RUN:1;                     /**< \brief [15:15] Run Indicator (rh) */
    unsigned int BITCOUNT:5;                /**< \brief [20:16] Bit Counter (rh) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int STEPCOUNT:4;               /**< \brief [27:24] Step Counter (rh) */
    unsigned int STEPS:1;                   /**< \brief [28:28] Step Counter Sign (rh) */
    unsigned int STEPD:1;                   /**< \brief [29:29] Step Counter Direction (rh) */
    unsigned int SGNCG:1;                   /**< \brief [30:30] Sign Signal from Carrier Generator (rh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_DSADC_CGCFG_Bits;

/** \\brief  Boundary Select Register */
typedef struct _Ifx_DSADC_CH_BOUNDSEL_Bits
{
    unsigned int BOUNDARYL:16;              /**< \brief [15:0] Lower Boundary Value for Limit Checking (rw) */
    unsigned int BOUNDARYU:16;              /**< \brief [31:16] Upper Boundary Value for Limit Checking (rw) */
} Ifx_DSADC_CH_BOUNDSEL_Bits;

/** \\brief  Carrier Generator Synchronization Register */
typedef struct _Ifx_DSADC_CH_CGSYNC_Bits
{
    unsigned int SDCOUNT:8;                 /**< \brief [7:0] Sign Delay Counter (rh) */
    unsigned int SDCAP:8;                   /**< \brief [15:8] Sign Delay Capture Value (rh) */
    unsigned int SDPOS:8;                   /**< \brief [23:16] Sign Delay Value for Positive Halfwave (rw) */
    unsigned int SDNEG:8;                   /**< \brief [31:24] Sign Delay Value for Negative Halfwave (rw) */
} Ifx_DSADC_CH_CGSYNC_Bits;

/** \\brief  Demodulator Input Configuration Register */
typedef struct _Ifx_DSADC_CH_DICFG_Bits
{
    unsigned int DSRC:4;                    /**< \brief [3:0] Input Data Source Select (rw) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int DSWC:1;                    /**< \brief [7:7] Write Control for Data Selection (w) */
    unsigned int ITRMODE:2;                 /**< \brief [9:8] Integrator Trigger Mode (rw) */
    unsigned int TSTRMODE:2;                /**< \brief [11:10] Timestamp Trigger Mode (rw) */
    unsigned int TRSEL:3;                   /**< \brief [14:12] Trigger Select (rw) */
    unsigned int TRWC:1;                    /**< \brief [15:15] Write Control for Trigger Parameters (w) */
    unsigned int CSRC:4;                    /**< \brief [19:16] Sample Clock Source Select (rw) */
    unsigned int STROBE:4;                  /**< \brief [23:20] Data Strobe Generation Mode (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int SCWC:1;                    /**< \brief [31:31] Write Control for Strobe/Clock Selection (w) */
} Ifx_DSADC_CH_DICFG_Bits;

/** \\brief  Filter Configuration Register, Auxiliary Filter */
typedef struct _Ifx_DSADC_CH_FCFGA_Bits
{
    unsigned int CFADF:8;                   /**< \brief [7:0] CIC Filter (Auxiliary) Decimation Factor (rw) */
    unsigned int CFAC:2;                    /**< \brief [9:8] CIC Filter (Auxiliary) Configuration (rw) */
    unsigned int SRGA:2;                    /**< \brief [11:10] Service Request Generation Auxiliary Filter (rw) */
    unsigned int ESEL:2;                    /**< \brief [13:12] Event Select (rw) */
    unsigned int EGT:1;                     /**< \brief [14:14] Event Gating (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int AFSC:2;                    /**< \brief [17:16] Auxiliary Filter Shift Control (rw) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int CFADCNT:8;                 /**< \brief [31:24] CIC Filter (Auxiliary) Decimation Counter (rh) */
} Ifx_DSADC_CH_FCFGA_Bits;

/** \\brief  Filter Configuration Register, Main CIC Filter */
typedef struct _Ifx_DSADC_CH_FCFGC_Bits
{
    unsigned int CFMDF:8;                   /**< \brief [7:0] CIC Filter (Main Chain) Decimation Factor (rw) */
    unsigned int CFMC:2;                    /**< \brief [9:8] CIC Filter (Main Chain) Configuration (rw) */
    unsigned int CFEN:1;                    /**< \brief [10:10] CIC Filter Enable (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int MFSC:2;                    /**< \brief [13:12] Main Filter Shift Control (rw) */
    unsigned int SRGM:2;                    /**< \brief [15:14] Service Request Generation Main Chain (rw) */
    unsigned int CFMSV:8;                   /**< \brief [23:16] CIC Filter (Main Chain) Start Value (rw) */
    unsigned int CFMDCNT:8;                 /**< \brief [31:24] CIC Filter (Main Chain) Decimation Counter (rh) */
} Ifx_DSADC_CH_FCFGC_Bits;

/** \\brief  Filter Configuration Register, Main Filter Chain */
typedef struct _Ifx_DSADC_CH_FCFGM_Bits
{
    unsigned int FIR0EN:1;                  /**< \brief [0:0] FIR Filter 0 Enable (rw) */
    unsigned int FIR1EN:1;                  /**< \brief [1:1] FIR Filter 1 Enable (rw) */
    unsigned int OCEN:1;                    /**< \brief [2:2] Offset Compensation Filter Enable (rw) */
    unsigned int DSH:2;                     /**< \brief [4:3] Data Shift Control (rw) */
    unsigned int FSH:1;                     /**< \brief [5:5] FIR Shift Control (rw) */
    unsigned int reserved_6:26;             /**< \brief \internal Reserved */
} Ifx_DSADC_CH_FCFGM_Bits;

/** \\brief  Integration Window Control Register */
typedef struct _Ifx_DSADC_CH_IWCTR_Bits
{
    unsigned int NVALCNT:6;                 /**< \brief [5:0] Number of Values Counted (rh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int INTEN:1;                   /**< \brief [7:7] Integration Enable (rh) */
    unsigned int REPCNT:4;                  /**< \brief [11:8] Integration Cycle Counter (rh) */
    unsigned int REPVAL:4;                  /**< \brief [15:12] Number of Integration Cycles (rw) */
    unsigned int NVALDIS:6;                 /**< \brief [21:16] Number of Values Discarded (rw) */
    unsigned int reserved_22:1;             /**< \brief \internal Reserved */
    unsigned int IWS:1;                     /**< \brief [23:23] Integration Window Size (rw) */
    unsigned int NVALINT:6;                 /**< \brief [29:24] Number of Values Integrated (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_CH_IWCTR_Bits;

/** \\brief  Modulator Configuration Register */
typedef struct _Ifx_DSADC_CH_MODCFG_Bits
{
    unsigned int INCFGP:2;                  /**< \brief [1:0] Configuration of Positive Input Line (rw) */
    unsigned int INCFGN:2;                  /**< \brief [3:2] Configuration of Negative Input Line (rw) */
    unsigned int GAINSEL:4;                 /**< \brief [7:4] Gain Select of Analog Input Path (rw) */
    unsigned int INSEL:2;                   /**< \brief [9:8] Input Pin Selection (rw) */
    unsigned int INMUX:2;                   /**< \brief [11:10] Input Multiplexer Setting (rh) */
    unsigned int INMODE:2;                  /**< \brief [13:12] Input Multiplexer Control Mode (rw) */
    unsigned int INMAC:1;                   /**< \brief [14:14] Input Multiplexer Action Control (rw) */
    unsigned int INCWC:1;                   /**< \brief [15:15] Write Control for Input Parameters (w) */
    unsigned int DIVM:4;                    /**< \brief [19:16] Divider Factor for Modulator Clock (rw) */
    unsigned int reserved_20:3;             /**< \brief \internal Reserved */
    unsigned int DWC:1;                     /**< \brief [23:23] Write Control for Divider Factor (w) */
    unsigned int CMVS:2;                    /**< \brief [25:24] Common Mode Voltage Selection (rw) */
    unsigned int MCFG:2;                    /**< \brief [27:26] Modulator Configuration (rw) */
    unsigned int GCEN:1;                    /**< \brief [28:28] Gain Calibration Enable (rw) */
    unsigned int APC:1;                     /**< \brief [29:29] Automatic Power Control (rw) */
    unsigned int reserved_30:1;             /**< \brief \internal Reserved */
    unsigned int MWC:1;                     /**< \brief [31:31] Write Control for Mode Selection (w) */
} Ifx_DSADC_CH_MODCFG_Bits;

/** \\brief  Offset Register Main Filter */
typedef struct _Ifx_DSADC_CH_OFFM_Bits
{
    unsigned int OFFSET:16;                 /**< \brief [15:0] Offset Value (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_CH_OFFM_Bits;

/** \\brief  Rectification Configuration Register */
typedef struct _Ifx_DSADC_CH_RECTCFG_Bits
{
    unsigned int RFEN:1;                    /**< \brief [0:0] Rectification Enable (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int SSRC:2;                    /**< \brief [5:4] Sign Source (rw) */
    unsigned int reserved_6:9;              /**< \brief \internal Reserved */
    unsigned int SDCVAL:1;                  /**< \brief [15:15] Sign Delay Capture Valid Flag (rh) */
    unsigned int reserved_16:14;            /**< \brief \internal Reserved */
    unsigned int SGNCS:1;                   /**< \brief [30:30] Selected Carrier Sign Signal (rh) */
    unsigned int SGND:1;                    /**< \brief [31:31] Sign Signal Delayed (rh) */
} Ifx_DSADC_CH_RECTCFG_Bits;

/** \\brief  Result Register Auxiliary Filter */
typedef struct _Ifx_DSADC_CH_RESA_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_CH_RESA_Bits;

/** \\brief  Result Register Main Filter */
typedef struct _Ifx_DSADC_CH_RESM_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_CH_RESM_Bits;

/** \\brief  Time-Stamp Register */
typedef struct _Ifx_DSADC_CH_TSTMP_Bits
{
    unsigned int RESULT:16;                 /**< \brief [15:0] Result of most recent conversion (rh) */
    unsigned int CFMDCNT:8;                 /**< \brief [23:16] CIC Filter (Main Chain) Decimation Counter (rh) */
    unsigned int NVALCNT:6;                 /**< \brief [29:24] Number of Values Counted (rh) */
    unsigned int TSVAL:1;                   /**< \brief [30:30] Timestamp Valid (rh) */
    unsigned int TSSR:1;                    /**< \brief [31:31] Timestamp Service Request (rw) */
} Ifx_DSADC_CH_TSTMP_Bits;

/** \\brief  Clock Control Register */
typedef struct _Ifx_DSADC_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (r) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_DSADC_CLC_Bits;

/** \\brief  Event Flag Register */
typedef struct _Ifx_DSADC_EVFLAG_Bits
{
    unsigned int RESEV0:1;                  /**< \brief [0:0] Result Event (rwh) */
    unsigned int RESEV1:1;                  /**< \brief [1:1] Result Event (rwh) */
    unsigned int RESEV2:1;                  /**< \brief [2:2] Result Event (rwh) */
    unsigned int RESEV3:1;                  /**< \brief [3:3] Result Event (rwh) */
    unsigned int RESEV4:1;                  /**< \brief [4:4] Result Event (rwh) */
    unsigned int RESEV5:1;                  /**< \brief [5:5] Result Event (rwh) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int ALEV0:1;                   /**< \brief [16:16] Alarm Event (rwh) */
    unsigned int ALEV1:1;                   /**< \brief [17:17] Alarm Event (rwh) */
    unsigned int ALEV2:1;                   /**< \brief [18:18] Alarm Event (rwh) */
    unsigned int ALEV3:1;                   /**< \brief [19:19] Alarm Event (rwh) */
    unsigned int ALEV4:1;                   /**< \brief [20:20] Alarm Event (rwh) */
    unsigned int ALEV5:1;                   /**< \brief [21:21] Alarm Event (rwh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_EVFLAG_Bits;

/** \\brief  Event Flag Clear Register */
typedef struct _Ifx_DSADC_EVFLAGCLR_Bits
{
    unsigned int RESEC0:1;                  /**< \brief [0:0] Result Event Clear (w) */
    unsigned int RESEC1:1;                  /**< \brief [1:1] Result Event Clear (w) */
    unsigned int RESEC2:1;                  /**< \brief [2:2] Result Event Clear (w) */
    unsigned int RESEC3:1;                  /**< \brief [3:3] Result Event Clear (w) */
    unsigned int RESEC4:1;                  /**< \brief [4:4] Result Event Clear (w) */
    unsigned int RESEC5:1;                  /**< \brief [5:5] Result Event Clear (w) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int ALEC0:1;                   /**< \brief [16:16] Alarm Event Clear (w) */
    unsigned int ALEC1:1;                   /**< \brief [17:17] Alarm Event Clear (w) */
    unsigned int ALEC2:1;                   /**< \brief [18:18] Alarm Event Clear (w) */
    unsigned int ALEC3:1;                   /**< \brief [19:19] Alarm Event Clear (w) */
    unsigned int ALEC4:1;                   /**< \brief [20:20] Alarm Event Clear (w) */
    unsigned int ALEC5:1;                   /**< \brief [21:21] Alarm Event Clear (w) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_EVFLAGCLR_Bits;

