HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxDsadc_regdef.h
/** \\brief  Global Configuration Register */
typedef struct _Ifx_DSADC_GLOBCFG_Bits
{
    unsigned int MCSEL:3;                   /**< \brief [2:0] Modulator Clock Select (rw) */
    unsigned int reserved_3:8;              /**< \brief \internal Reserved */
    unsigned int IRM0:1;                    /**< \brief [11:11] Internal Resistance Measurement Control (rw) */
    unsigned int IRM2:1;                    /**< \brief [12:12] Internal Resistance Measurement Control (rw) */
    unsigned int IRM4:1;                    /**< \brief [13:13] Internal Resistance Measurement Control (rw) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int IBSEL:4;                   /**< \brief [19:16] Bias Current Select (rw) */
    unsigned int LOSUP:1;                   /**< \brief [20:20] Low Power Supply Voltage Select (rw) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int ICT:1;                     /**< \brief [22:22] Internal Channel Test (rw) */
    unsigned int PSWC:1;                    /**< \brief [23:23] Write Control for Power Supply Parameters (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBCFG_Bits;

/** \\brief  Global Run Control Register */
typedef struct _Ifx_DSADC_GLOBRC_Bits
{
    unsigned int CH0RUN:1;                  /**< \brief [0:0] Channel 0 Run Control (rw) */
    unsigned int CH1RUN:1;                  /**< \brief [1:1] Channel 1 Run Control (rw) */
    unsigned int CH2RUN:1;                  /**< \brief [2:2] Channel 2 Run Control (rw) */
    unsigned int CH3RUN:1;                  /**< \brief [3:3] Channel 3 Run Control (rw) */
    unsigned int CH4RUN:1;                  /**< \brief [4:4] Channel 4 Run Control (rw) */
    unsigned int CH5RUN:1;                  /**< \brief [5:5] Channel 5 Run Control (rw) */
    unsigned int reserved_6:10;             /**< \brief \internal Reserved */
    unsigned int M0RUN:1;                   /**< \brief [16:16] Modulator 0 Run Control (rw) */
    unsigned int M1RUN:1;                   /**< \brief [17:17] Modulator 1 Run Control (rw) */
    unsigned int M2RUN:1;                   /**< \brief [18:18] Modulator 2 Run Control (rw) */
    unsigned int M3RUN:1;                   /**< \brief [19:19] Modulator 3 Run Control (rw) */
    unsigned int M4RUN:1;                   /**< \brief [20:20] Modulator 4 Run Control (rw) */
    unsigned int M5RUN:1;                   /**< \brief [21:21] Modulator 5 Run Control (rw) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_DSADC_GLOBRC_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_DSADC_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MOD_TYPE:8;                /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_DSADC_ID_Bits;

/** \\brief  Kernel Reset Register 0 */
typedef struct _Ifx_DSADC_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST0_Bits;

/** \\brief  Kernel Reset Register 1 */
typedef struct _Ifx_DSADC_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRST1_Bits;

/** \\brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_DSADC_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_DSADC_KRSTCLR_Bits;

/** \\brief  OCDS Control and Status Register */
typedef struct _Ifx_DSADC_OCS_Bits
{
    unsigned int reserved_0:24;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_DSADC_OCS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_ACCEN0_Bits B;
} Ifx_DSADC_ACCEN0;

/** \\brief  Access Protection Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_ACCPROT_Bits B;
} Ifx_DSADC_ACCPROT;

/** \\brief  Carrier Generator Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CGCFG_Bits B;
} Ifx_DSADC_CGCFG;

/** \\brief  Boundary Select Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_BOUNDSEL_Bits B;
} Ifx_DSADC_CH_BOUNDSEL;

/** \\brief  Carrier Generator Synchronization Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_CGSYNC_Bits B;
} Ifx_DSADC_CH_CGSYNC;

/** \\brief  Demodulator Input Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_DICFG_Bits B;
} Ifx_DSADC_CH_DICFG;

/** \\brief  Filter Configuration Register, Auxiliary Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_FCFGA_Bits B;
} Ifx_DSADC_CH_FCFGA;

/** \\brief  Filter Configuration Register, Main CIC Filter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_DSADC_CH_FCFGC_Bits B;
} Ifx_DSADC_CH_FCFGC;

